# UpOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CameraInfo..::..UpOffset Property
CameraInfo Class See Also
---
Distance that the target plane is offset in the direction of the Up direction. This offset shifts both top and bottom planes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double UpOffset { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UpOffset As Double
	Get
```

Visual C++
---
```text
public:
property double UpOffset {
	double get ();
}
```

# See Also
CameraInfo Class
Autodesk.Revit.DB Namespace